<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Webex and imports it into Munki.</string>
	<key>Identifier</key>
	<string>de.JvM.pkg.munki.Webex-arm</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Webex</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>AKTIV</string>
			</array>
			<key>description</key>
			<string>Make teamwork your best work.</string>
			<key>developer</key>
			<string>Cisco</string>
			<key>category</key>
			<string>Communication</string>
			<key>display_name</key>
			<string>Webex</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>installable_condition</key>
			<string>arch == "arm64"</string>
			<key>icon_name</key>
			<string>Webex_new.png</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>de.JvM.pkg.download.Webex-arm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
