<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Sonos S1 Controller and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.MarcelRei.munki.SonosS1Controller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Sonos S1 Controller</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>AKTIV</string>
			</array>
			<key>description</key>
			<string>Full-fledged controller for the Sonos Music System.</string>
			<key>developer</key>
			<string>Sonos, Inc.</string>
			<key>category</key>
			<string>Utilities</string>
			<key>display_name</key>
			<string>Sonos S1 Controller</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>icon_name</key>
			<string>SonosS1.png</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.MarcelRei.download.SonosS1Controller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
